# St7SetResFileCaseName

Sets the name of the specified result case in the custom result file.

Strand7 API Manual

long St7SetResFileCaseName(long uID, long CaseNum, char* CaseName)

Input Parameters

uID

Strand7 model file ID.

CaseNum

Result case number.

CaseName

Result case name.